## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 4 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                           |
|----------|-----------------------------------------------------------------------------------------|
| add      | `aws_acm_certificate.form_viewer`                                                       |
|          | `aws_acm_certificate.form_viewer_maintenance_mode`                                      |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-staging.cdssandbox.xyz&quot;]` |
|          | `aws_s3_bucket_website_configuration.maintenance_mode`                                  |
|          | `aws_wafv2_web_acl.forms_maintenance_mode_acl`                                          |
| delete   | `aws_acm_certificate.form_viewer`                                                       |
| update   | `aws_cloudfront_distribution.maintenance_mode`                                          |
|          | `aws_lb_listener.form_viewer_https`                                                     |
|          | `aws_route53_record.form_viewer[0]`                                                     |
|          | `aws_wafv2_regex_pattern_set.forms_base_url`                                            |
| recreate | `aws_route53_health_check.gc_forms_application`                                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.form_viewer will be created
  + resource "aws_acm_certificate" "form_viewer" {
      + arn                       = (known after apply)
      + domain_name               = "forms-staging.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.form_viewer (deposed object 7bf10a94) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "form_viewer" {
      - arn                       = "arn:aws:acm:ca-central-1:687401027353:certificate/387f24ee-0a1d-48be-979a-e4196ea1a401" -> null
      - domain_name               = "forms-staging.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/387f24ee-0a1d-48be-979a-e4196ea1a401" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.form_viewer_maintenance_mode will be created
  + resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
      + arn                       = (known after apply)
      + domain_name               = "forms-staging.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        id                             = "E2NX6QAIR13JTM"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      + web_acl_id                     = (known after apply)
        # (19 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          - cloudfront_default_certificate = true -> null
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:687401027353:certificate/387f24ee-0a1d-48be-979a-e4196ea1a401" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
        tags              = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_health_check.gc_forms_application must be replaced
-/+ resource "aws_route53_health_check" "gc_forms_application" {
      ~ arn                    = "arn:aws:route53:::healthcheck/0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
      - child_health_threshold = 0 -> null
      - child_healthchecks     = [] -> null
      ~ enable_sni             = true -> (known after apply)
      ~ id                     = "0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
      - invert_healthcheck     = false -> null
      ~ port                   = 443 -> 80
      - regions                = [] -> null
        tags                   = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ type                   = "HTTPS" -> "HTTP" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
      ~ health_check_id = "0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
        id              = "Z05990652HOQ0SGHD81ZC_forms-staging.cdssandbox.xyz_A_form_viewer_forms-staging.cdssandbox.xyz_primary"
        name            = "forms-staging.cdssandbox.xyz"
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = "gc-forms-application-maintenance-page"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "^form-viewer-1810755345.ca-central-1.elb.amazonaws.com$" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.forms_maintenance_mode_acl will be created
  + resource "aws_wafv2_web_acl" "forms_maintenance_mode_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "GCFormsMaintenanceMode"
      + scope      = "CLOUDFRONT"
      + tags       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowGetRequestOnRootOnly"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "GET"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "/"

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AllowGetRequestOnRootOnly"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "forms_maintenance_mode_global_rule"
          + sampled_requests_enabled   = false
        }
    }

Plan: 6 to add, 4 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
